<a href="https://colab.research.google.com/github/pepesrz91/machine-learning-2021-mcc/blob/master/ProjectoFinal.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
import numpy as np

Parte 1. Análisis numérico y gráfico de los datos.

## Información sobre los datos

Los datos a utilizar se encuentran en: 
https://archive.ics.uci.edu/ml/datasets/default+of+credit+card+clients

In [12]:
data = pd.read_excel("/content/drive/MyDrive/Presentaciones/default_cards.xls")
column_names = data.iloc[0]
data = data[1:] 
data.columns = column_names

In [13]:
data.head()

0 ID LIMIT_BAL SEX  ... PAY_AMT5 PAY_AMT6 default payment next month
1  1     20000   2  ...        0        0                          1
2  2    120000   2  ...        0     2000                          1
3  3     90000   2  ...     1000     5000                          0
4  4     50000   2  ...     1069     1000                          0
5  5     50000   1  ...      689      679                          0

[5 rows x 25 columns]

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 1 to 30000
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30000 non-null  object
 1   LIMIT_BAL                   30000 non-null  object
 2   SEX                         30000 non-null  object
 3   EDUCATION                   30000 non-null  object
 4   MARRIAGE                    30000 non-null  object
 5   AGE                         30000 non-null  object
 6   PAY_0                       30000 non-null  object
 7   PAY_2                       30000 non-null  object
 8   PAY_3                       30000 non-null  object
 9   PAY_4                       30000 non-null  object
 10  PAY_5                       30000 non-null  object
 11  PAY_6                       30000 non-null  object
 12  BILL_AMT1                   30000 non-null  object
 13  BILL_AMT2                   30000 non-null  object
 14  BILL_AMT3                   30000 non-null  object
 15  BILL_AMT4                   30000 non-null  object
 16  BILL_AMT5                   30000 non-null  object
 17  BILL_AMT6                   30000 non-null  object
 18  PAY_AMT1                    30000 non-null  object
 19  PAY_AMT2                    30000 non-null  object
 20  PAY_AMT3                    30000 non-null  object
 21  PAY_AMT4                    30000 non-null  object
 22  PAY_AMT5                    30000 non-null  object
 23  PAY_AMT6                    30000 non-null  object
 24  default payment next month  30000 non-null  object
dtypes: object(25)
memory usage: 5.7+ MB

In [18]:
len(data[(data['PAY_0'] == 0) | (data['PAY_2'] == 0) | (data['PAY_3'] == 0) | ( data['PAY_4'] == 0)  | (data['PAY_5'] == 0)  | ( data['PAY_6'] == 0 )])

21173

In [16]:
len(data[(data['EDUCATION'] == 0) | (data['EDUCATION'] == 5) | (data['EDUCATION']== 6) | (data['MARRIAGE'] == 0) ])

399